In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

### Pandas
1. Series : 1차원 vector
2. Dataframe: 2차원 matrix

In [ ]:
# 1. Series

In [3]:
L = [1,2,4,5,7]
pd.Series(L)   # index 생성..

0    1
1    2
2    4
3    5
4    7
dtype: int64

In [5]:
pd.Series(L, index=['a','b','c','d','e'])

a    1
b    2
c    4
d    5
e    7
dtype: int64

In [8]:
s1 = pd.Series({'a':1, 'b':2, 'c':3, 'd':4, 'e':5})
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [9]:
s1['a']

1

In [10]:
s1['a':'c']

a    1
b    2
c    3
dtype: int64

In [11]:
s1['d'] = 100
s1

a      1
b      2
c      3
d    100
e      5
dtype: int64

In [12]:
# 2. DataFrame - column,하나하나가 Series이다..

In [18]:
raw_data = {
    'first_name':['jason','molly','tina','jake','any'],
    'last_name':['miller','jacobson','ali','milner','cooze'],
    'age':[42,52,36,24,75],
    'city':['san francisco', 'baltimore','miami','douglas','boston']
}

df = pd.DataFrame(raw_data)
df

  first_name last_name  age           city
0      jason    miller   42  san francisco
1      molly  jacobson   52      baltimore
2       tina       ali   36          miami
3       jake    milner   24        douglas
4        any     cooze   75         boston

In [16]:
pd.DataFrame(raw_data, columns=['last_name', 'first_name'])

  last_name first_name
0    miller      jason
1  jacobson      molly
2       ali       tina
3    milner       jake
4     cooze        any

In [20]:
df['first_name']

0    jason
1    molly
2     tina
3     jake
4      any
Name: first_name, dtype: object

In [21]:
df[['first_name','last_name']]

  first_name last_name
0      jason    miller
1      molly  jacobson
2       tina       ali
3       jake    milner
4        any     cooze

In [23]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [24]:
df.index = ['a','b','c','d','e']
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [26]:
# dataframe indexing, slicing - iloc(순번), loc(이름)

In [27]:
# 1. loc, iloc

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [28]:
df.loc[['b','c'], ['last_name', 'age']]

  last_name  age
b  jacobson   52
c       ali   36

In [30]:
df.iloc[[1,2], [1,2]]

  last_name  age
b  jacobson   52
c       ali   36

In [31]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [32]:
df.loc[['b','c'], :]

  first_name last_name  age       city
b      molly  jacobson   52  baltimore
c       tina       ali   36      miami

In [33]:
df.iloc[[1,2], :]

  first_name last_name  age       city
b      molly  jacobson   52  baltimore
c       tina       ali   36      miami

In [34]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [37]:
df.loc["b":"d", "first_name":"age"]

  first_name last_name  age
b      molly  jacobson   52
c       tina       ali   36
d       jake    milner   24

In [38]:
df.iloc[1:4, :3]

  first_name last_name  age
b      molly  jacobson   52
c       tina       ali   36
d       jake    milner   24

In [39]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [42]:
# 나이가 40대 이상인 데이터만 추출..
df[df['age'] >= 40]

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
e        any     cooze   75         boston

In [43]:
# city가 'miami'인 데이털 출력

In [46]:
df[df['city'] == 'miami']

  first_name last_name  age   city
c       tina       ali   36  miami

In [51]:
# 'ali'의 나이는?
df[df['last_name'] == 'ali']['age']

c    36
Name: age, dtype: int64

In [52]:
# row, column 삭제..

In [53]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [56]:
df.drop('d', inplace=True)

In [57]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
e        any     cooze   75         boston

In [60]:
df.drop('last_name', axis=1, inplace=True)

In [61]:
df

  first_name  age           city
a      jason   42  san francisco
b      molly   52      baltimore
c       tina   36          miami
e        any   75         boston

In [62]:
# apply

In [63]:
# groupby